#+TITLE: CS2105 Computer Networking
* Tutorial 7
1. Can the IP layer mess it up?
   Reordering might be still needed since might take different IP routes. TCP
   can handle reordering.
   Reliability: At the networking layer, if the buffer is full then packets (IP)
   can be dropped
   Queuing delay can jump up exponentially
2. G = =1001=
   Here is a little code snippet that does the division
   #+BEGIN_SRC python :session t7q2
import operator

def xor(bs1, bs2)->str:
    return str(operator.xor(int(bs1), int(bs2)))

def crc(d, g):
    len_d = len(d)
    r = len(g)
    # append r-1 zeroes
    rem = d + '0'*(r-1)
    while len(rem) >= r:
        # take the first r digits
        window = rem[:r]
        # bitwise xor with g
        xor_res = "".join([xor(window[i], g[i]) for i in range(r)])
        # replace the first r digits of d with result
        rem = str(int(xor_res)) + rem[r:]
        print("{: >20}".format(rem))
        # remove preceeding zeroes from d
    return '0'*(max(0,r-1-len(rem))) + rem
   #+END_SRC
   #+RESULTS:
   : None
   a. D = =11000111010=
      #+BEGIN_SRC python :session t7q2 :results output
crc("11000111010", "1001")
      #+END_SRC

      #+RESULTS:
      : 1010111010000
      :          11111010000
      :           1101010000
      :            100010000
      :               110000
      :                10100
      :                  110
      : '110'
   b.
           #+BEGIN_SRC python :session t7q2 :results output
     crc("01101010101", "1001")
           #+END_SRC

           #+RESULTS:
           : 11111010101000
           :        1101010101000
           :         100010101000
           :            110101000
           :             10001000
           :                11000
           :                 1010
           :                   11
           : '011'
   c.
           #+BEGIN_SRC python :session t7q2 :results output
     crc("11111010101","1001")
           #+END_SRC

           #+RESULTS:
           : 1101010101000
           :         100010101000
           :            110101000
           :             10001000
           :                11000
           :                 1010
           :                   11
           : '011'
   d.
          #+BEGIN_SRC python :session t7q2 :results output
    crc("1000110001","1001")
          #+END_SRC

          #+RESULTS:
          : 1110001000
          :            111001000
          :             11101000
          :              1111000
          :               110000
          :                10100
          :                  110
          : '110'
3.
   a. (1,1) flipped. Actually any one bit flip, as the column and row parity
      will always be able to pinpoint a coordinate
   b. (1,1) and (3,1) for example. Parities in conflict are rows 1 and 3, but
      not sure what is wrong, since (1,3) and (3,3) flipping would cause the
      same error.
   c. combine both in b.
4. Time division is good since everyone will likely use their own share
   (guaranteeing high throughput). Frequency division is good too.

   Carrier sensing is not that good because of propagation delay, it is likely
   to go into a live lock.

   Token passing is fine but have to deal with the failure of token.
5.
   a. 244. 245 B would know that A is sending alr.
   b. A will know B is sending at (244+245=489). But the minimal time A has to
      send for = (framesize=64*8=512) so it will know.
** 1819 Sem 2
:LOGBOOK:
CLOCK: [2020-04-16 Thu 16:43]--[2020-04-16 Thu 17:28] =>  0:45
:END:
